{
  "103": "The Roblox experience you are trying to join is currently not available. Displayed on Xbox when the game is unavailable on this platform.",
  "256": "Developer has shut down all game servers or game server has shut down for other reasons. Appears if a player is banned while playing alone.",
  "260": "There was a problem receiving data, please reconnect. Possibly a Roblox or local issue preventing data packets.",
  "261": "Error while receiving data, please reconnect. Could be poor internet or server issues.",
  "262": "Error while sending data, please reconnect. Game cannot load after data fails to send.",
  "264": "Same account launched game from different device. Reconnect if you prefer to use this device. Can also indicate rapid rejoin or server crash.",
  "266": "Your connection timed out. Check your internet connection and try again.",
  "267": "You were kicked from this experience. Can include custom reason messages from the game using :Kick().",
  "268": "You have been kicked by server. Could be due to exploits, lag, or compatibility issues (like Wine on Linux).",
  "271": "Server was shut down due to no active players. Also appears if reconnecting while server is shutting down.",
  "272": "Disconnected due to Security Key Mismatch. Often triggered if an exploit is loaded.",
  "273": "Disconnected from game, possibly due to game joined from another device, or user is warned/banned. Reconnect may show error 769/773.",
  "274": "The experience's developer has temporarily shut down the experience server. Try again later.",
  "275": "Roblox has shut down the server for maintenance, or the game was deleted.",
  "277": "Lost connection to the game server, please reconnect. Can happen from internet issues or server overload.",
  "278": "You were disconnected for being idle 20 minutes.",
  "279": "Failed to connect to the game. Could be due to server crash, website blocks, downtime, or outdated client.",
  "280": "Your version of Roblox may be out of date. Update Roblox and try again.",
  "282": "Disconnected from game, please reconnect. Could be network issues or game under review.",
  "284": "A fatal error occurred while running this game. Often caused by UI overload.",
  "285": "Client initiated disconnect. Can occur after error 256/274.",
  "286": "Device does not have enough memory to run this experience, or removed from private server.",
  "291": "Player has been removed from the DataModel. Sometimes used to kick a player.",
  "292": "Device memory low. Leaving preserves state and prevents crashing.",
  "517": "This game is currently unavailable. Happens when rejoining a server being closed.",
  "522": "Followed user has left the game.",
  "523": "Status of the experience has changed, no longer accessible. Can happen if game is unpublished/private.",
  "524": "Not authorized to join this game. VIP server, paid access, private server, or Guest access issues.",
  "525": "Server is currently busy. Try again later.",
  "528": "Your party is too large to join this experience.",
  "529": "A HTTP error has occurred. Servers may be down or slow.",
  "533": "Privacy settings prevent you from joining this server.",
  "600": "You were banned from this experience by the creator.",
  "610": "Can't join place. Could be DNS, private server, guest restrictions, Game Pass requirements, unsupported device, or HTTP errors.",
  "769": "Teleport failed or reconnect unsuccessful. Can occur after bans/warnings or network issues.",
  "770": "Game's root place is not active or teleport target does not exist.",
  "771": "Teleport failed, server is no longer available.",
  "772": "Teleport failed, server is full.",
  "773": "Teleport failed. Game not approved or restricted. Can appear after private server shutdowns or warnings.",
  "774": "Too many teleport requests received. Experience tried to teleport user above limit."
}
